app/Models/Auth/M_user_role.php

    public function getRole($group_code)
    {
        $builder = $this->db->table($this->table);
        $builder->select('module_name,role_name,role_value');
        $builder->where(['group_code' => $group_code]);
        return $builder->get();
---
SELECT `module_name`, `role_name`, `role_value`
FROM `user_role`
WHERE `group_code` = 'L00'