app/Models/Log/M_log_queries.php

    public function getLogDetail($log_id)
    {
        $db = \Config\Database::connect($this->DBGroup);
        return $db->table('dt_log_queries')->where('log_id', $log_id)->get();
---
SELECT *
FROM `dt_log_queries`
WHERE `log_id` = '3'